Revit 2027 API
GroupTypeId.ElectricalEngineering Property
 Electrical Engineering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElectricalEngineering { get; }
Public Shared ReadOnly Property ElectricalEngineering As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElectricalEngineering {
	ForgeTypeId^ get ();
}
static member ElectricalEngineering : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace